Catalogs/упАдреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАдреса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботВТочке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГеографическаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеОтклонениеУбытияИзТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВремяУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормализованноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоординаты</Name>
					<Comment>Представление широты и долготы в формате "34.451234;45.345666;"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГеографическиеЗоны</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Nominatim_place_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>osm_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗоны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляУчетаМестоположений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроходитЧерез180Меридиан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПопарныеРасстоянияМеждуТочкамиЗоны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильОтображения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиПолигонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Полигон</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолигонПростой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упАдреса/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()

	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Параметры.ЗначенияЗаполнения.Свойство("ГеографическаяЗона") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ГеографическаяЗона) Тогда 
		Объект.Страна = Параметры.ЗначенияЗаполнения.ГеографическаяЗона.Страна;
		Объект.Регион = Параметры.ЗначенияЗаполнения.ГеографическаяЗона.Регион;
	КонецЕсли;	
	ЭтаФорма.ПредыдущееНаименование = Объект.Наименование;
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.Подтвержден Тогда
		// Для утвержденных объектов нельзя вносить изменения.		
		ТолькоПросмотр = НЕ ЭтаФорма.ЕстьПравоРедактировать;
		// Отключим доступность к командам.
		Элементы.ФормаЗаполнитьПоКлассификатору.Доступность = Ложь;
		Элементы.ОпределитьГеозону.Доступность              = Ложь;
		Элементы.ОпределитьКоординаты.Доступность           = Ложь;
	КонецЕсли;
	Элементы.Подтвержден.ТолькоПросмотр = НЕ ЭтаФорма.ЕстьПравоРедактировать;
	упСервисныеФункцииКлиентСервер.УстановитьКартинкуКомментария(Элементы.ГруппаКомментарий, Объект.Комментарий);
	ОбновитьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ЭтаФорма.ЕстьПравоРедактировать = Справочники.упАдреса.ВыполнитьПроверкуПраваПодтверждениеКорректностиГеографическихДанных();
	ЭтаФорма.упНормализоватьАдресаСервисомDadata = ПолучитьФункциональнуюОпцию("упНормализоватьАдресаСервисомDadata");
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.упАдреса) Тогда
		Элементы.ОпределитьКоординаты.Видимость = Ложь;	
	КонецЕсли;
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	 УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Перенесено в модуль объетка обработчик ПередЗаписью
	//Если ПолучитьФункциональнуюОпцию("упНормализоватьАдресаСервисомDadata") Тогда
	//	НормализованноеНаименование = упГеокодированиеСервер.НормализованныйАдрес(ТекущийОбъект.Наименование);
	//	Если ЗначениеЗаполнено(НормализованноеНаименование) Тогда
	//		ТекущийОбъект.НормализованноеНаименование = НормализованноеНаименование;
	//	КонецЕсли; 
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
	     ОбновитьЭлементыДополнительныхРеквизитов();
	 КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	упСервисныеФункцииКлиент.ФормаСсылочныйОбъект_ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолноеНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	сткПараметры = Новый Структура("ОткрытаПоСценарию, ВидКонтактнойИнформации, ЗначенияПолей", Истина, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.Адрес"), Объект.КонтактнаяИнформация);
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводАдреса", сткПараметры, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.ПолноеНаименование) ИЛИ ПредыдущееНаименование = Объект.ПолноеНаименование Тогда 
		Объект.ПолноеНаименование = Объект.Наименование;
	КонецЕсли;	
	ПредыдущееНаименование = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ГеографическаяЗонаПриИзменении(Элемент)
	
	сткВозврат = ГеографическаяЗонаПриИзмененииСервер(Объект.ГеографическаяЗона);
	Если ЗначениеЗаполнено(сткВозврат.Страна) И сткВозврат.Страна <> Объект.Страна Тогда 
		Объект.Страна = сткВозврат.Страна;
		Объект.Регион = Неопределено;
	КонецЕсли;	
	Если ЗначениеЗаполнено(сткВозврат.Регион) Тогда 
		Объект.Регион = сткВозврат.Регион;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ОпределитьКоординаты(Команда)
	
	Если упНормализоватьАдресаСервисомDadata Тогда
		НормализованноеНаименованиеНачалоВыбораНаСервере();
	КонецЕсли; 
	Структура = Новый Структура("Город,Дом,НаселенныйПункт,Район,Страна,Строение,Улица,Индекс");
	ЗаполнитьЗначенияСвойств(Структура,Объект);
	Структура.Вставить("Регион",СокрЛП(Объект.Регион));
	сткДнные = ПолучитьЗначениеРеквизита(Объект.Страна, "КодАльфа2");
	Структура.Вставить("КодАльфа2",?(ЗначениеЗаполнено(Объект.Страна),сткДнные.КодАльфа2,""));
	Если ЗначениеЗаполнено(Объект.НормализованноеНаименование) И упНормализоватьАдресаСервисомDadata Тогда
		СтрокаПоиска = Объект.НормализованноеНаименование;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда 
		СтрокаПоиска = Объект.ПолноеНаименование;
	Иначе
		СтрокаПоиска = Объект.Наименование;
	КонецЕсли;
	Структура.Вставить("Представление",СтрокаПоиска);
	Если Не ЗначениеЗаполнено(СтрокаПоиска) Тогда 
		Возврат;
	КонецЕсли;
	#Если НЕ ВебКлиент Тогда
		сткКоординаты = упГеокодированиеКлиентСервер.НайтиКоординатыАдреса(Структура);
	#Иначе	
		сткКоординаты = упГеокодированиеСервер.НайтиКоординатыАдреса(Структура);
	#КонецЕсли	
	Если сткКоординаты = Неопределено Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Геокодирование'"),, НСтр("ru = 'Не удалось определить координаты выделенных адресов'"), БиблиотекаКартинок.Ошибка32);
	Иначе
		ЗаполнитьЗначенияСвойств(Объект, сткКоординаты);
		Если Не ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда 
			Объект.ПолноеНаименование = Объект.ПолноеПредставление;
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // ОпределитьКоординаты()

&НаКлиенте
Процедура ОпределитьГеозону(Команда)
	
	Если Объект.Долгота = 0 И Объект.Широта = 0 Тогда 
		ОпределитьКоординаты(Неопределено);
		Если Объект.Долгота = 0 И Объект.Широта = 0 Тогда 
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	сткГеозона = ОпределитьГеозонуНаСервере(Объект.Долгота, Объект.Широта);
	Если сткГеозона <> Неопределено Тогда 
		Объект.ГеографическаяЗона = сткГеозона.Зона;
		Если ЗначениеЗаполнено(сткГеозона.Страна) И сткГеозона.Страна <> Объект.Страна Тогда 
			Объект.Страна = сткГеозона.Страна;
			Объект.Регион = Неопределено;
		КонецЕсли;	
		Если ЗначениеЗаполнено(сткГеозона.Регион) Тогда 
			Объект.Регион = сткГеозона.Регион;
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось определить географическую зону по указанным координатам'"), Объект.Ссылка, "Объект.Долгота");
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ МЕХАНИЗМА СВОЙСТВ.

&НаКлиенте
// Открывает форму редактирования набора дополнительных реквизитов.
//
Процедура Подключаемый_РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКлассификатору(Команда)
	сткПараметры = Новый Структура("ОткрытаПоСценарию, ВидКонтактнойИнформации, ЗначенияПолей", Истина, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.Адрес"), Объект.КонтактнаяИнформация);
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводАдреса", сткПараметры, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Получим значение реквизита.
//
// Параметры:
//  ТекущийОбъект  - СправочникСсылка - Ссылка на объект.
//  Реквизит  - Строка - Имя реквизита.
//
// Возвращаемое значение:
//   Произвольное - ЗначениеРеквизита.
//
Функция ПолучитьЗначениеРеквизита(ТекущийОбъект, Реквизит)

	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект, Реквизит);	

КонецФункции // ПолучитьЗначениеРеквизита()

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)

	Объект.КонтактнаяИнформация = ВыбранноеЗначение.КонтактнаяИнформация;
	Если Объект.Наименование = СокрЛП(Лев(Объект.ПолноеНаименование, 150)) ИЛИ Не ЗначениеЗаполнено(Объект.Наименование) Тогда 
		Объект.Наименование = СокрЛП(Лев(ВыбранноеЗначение.Представление, 150));
	КонецЕсли;	
	Объект.ПолноеНаименование   = ВыбранноеЗначение.Представление;
	Объект.Комментарий          = ВыбранноеЗначение.Комментарий;
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(Объект.КонтактнаяИнформация) Тогда
		РезультатыЧтения = Новый Структура;
		XDTOКонтактная = УправлениеКонтактнойИнформациейСлужебный.АдресXMLВXDTO(Объект.КонтактнаяИнформация,,Перечисления.ТипыКонтактнойИнформации.Адрес);
		ЗначениеРеквизитовПоКонтактнойИнформации(Объект, XDTOКонтактная);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗначениеРеквизитовПоКонтактнойИнформации(Контекст, РедактируемаяИнформация)
	
	//ДанныеАдреса = РедактируемаяИнформация.Состав;
	//
	//// Страна по наименованию
	//НаименованиеСтраны = СокрЛП(ДанныеАдреса.Страна);
	//Если ПустаяСтрока(НаименованиеСтраны) Тогда
	//	Контекст.Страна = Справочники.СтраныМира.ПустаяСсылка();
	//Иначе
	//	СсылкаНаРоссию = Справочники.СтраныМира.Россия;
	//	Если ВРЕГ(НаименованиеСтраны)=ВРЕГ(СокрЛП(СсылкаНаРоссию.Наименование)) Тогда
	//		Контекст.Страна    = СсылкаНаРоссию;
	//	Иначе
	//		ДанныеСтраны = Справочники.СтраныМира.ДанныеСтраныМира(, НаименованиеСтраны);
	//		Если ДанныеСтраны=Неопределено Тогда
	//			// Не нашли ни в справочнике, ни в классификаторе
	//			Контекст.Страна    = Неопределено;
	//		Иначе
	//			Контекст.Страна    = ДанныеСтраны.Ссылка;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//// Индекс просто ставим
	//Контекст.Индекс = Формат(УправлениеКонтактнойИнформациейСлужебный.ПочтовыйИндексАдреса(ДанныеАдреса), "ЧГ=");
	//
	//// Синтетический "Населенный пункт" получаем как представление
	//НаселенныйПункт 		= УправлениеКонтактнойИнформациейСлужебный.ПредставлениеНаселенногоПункта(ДанныеАдреса);
	//АнализКлассификатора 	= УправлениеКонтактнойИнформациейСлужебный.НаселенныеПунктыПоПредставлению(НаселенныйПункт);
	//// Наименование населенного пункта не трогаем
	//НаселенныйПунктДетально            = УправлениеКонтактнойИнформациейСлужебный.СписокРеквизитовНаселенныйПункт();
	//// Из переданного XDTO
	//АдресРФ = УправлениеКонтактнойИнформациейСлужебный.РоссийскийАдрес(ДанныеАдреса);
	//Если АдресРФ<>Неопределено Тогда
	//	Для Каждого КлючЗначение Из НаселенныйПунктДетально Цикл
	//		Значение = КлючЗначение.Значение;
	//		ЗначениеЗначения = УправлениеКонтактнойИнформациейСлужебный.ПолучитьXDTOРеквизитОбъекта(АдресРФ, Значение.ПутьXPath);
	//		
	//		Части = УправлениеКонтактнойИнформациейКлиентСервер.НаименованиеСокращение(ЗначениеЗначения);
	//		Значение.Наименование = Части.Наименование;
	//		Значение.Сокращение   = Части.Сокращение;
	//		Значение.Представление	= ЗначениеЗначения;
	//	КонецЦикла;
	//КонецЕсли;
	//
	//ИдентификаторНаселенногоПункта = Неопределено;
	//УправлениеКонтактнойИнформациейСлужебный.ЗаполнитьИдентификаторыНаселенногоПункта(НаселенныйПунктДетально, ИдентификаторНаселенногоПункта);
	//Контекст.РегионСтрока    = НаселенныйПунктДетально.Регион.Наименование;
	//Контекст.Город           = НаселенныйПунктДетально.Город.Наименование;
	//Контекст.НаселенныйПункт = НаселенныйПунктДетально.НаселенныйПункт.Наименование;
	//Контекст.Район           = НаселенныйПунктДетально.Район.Наименование;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//	|	упРегионы.Ссылка
	//	|ИЗ
	//	|	Справочник.упРегионы КАК упРегионы
	//	|ГДЕ
	//	|	упРегионы.Владелец = &Владелец
	//	|	И упРегионы.Наименование = &Наименование";
	//	Запрос.УстановитьПараметр("Наименование", Контекст.РегионСтрока);
	//	
	//Запрос.УстановитьПараметр("Владелец", Контекст.Страна);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда 
	//	Контекст.Регион = Выборка.Ссылка;
	//КонецЕсли;	
	//
	////////////////////////////////
	//
	//// Синтетическую "Улицу" получаем как представление
	//Контекст.Улица = УправлениеКонтактнойИнформациейСлужебный.ПредставлениеУлицы(ДанныеАдреса);
	//АнализКлассификатора = УправлениеКонтактнойИнформациейСлужебный.УлицыПоПредставлению(ИдентификаторНаселенногоПункта, Контекст.Улица);
	//Если АнализКлассификатора.Количество() > 0 Тогда
	//	Контекст.Улица    = АнализКлассификатора[0].Наименование;
	//КонецЕсли;
	//
	//// Дом, строение, помещение
	//ЗданияИПомещения = УправлениеКонтактнойИнформациейСлужебный.ЗданияИПомещенияАдреса(ДанныеАдреса);
	//
	//// Первые два здания выделяем отдельно, остальное в списке
	//ТаблицаДанных = ЗданияИПомещения.Здания;
	//
	//// Вид = 1 - признак дома, владения. Вид = 2, доп строение
	//СтрокаДома = ТаблицаДанных.Найти(1, "Вид");
	//Если СтрокаДома <> Неопределено Тогда
	//	Контекст.ТипДома = СтрокаДома.Тип;
	//	Контекст.Дом     = СтрокаДома.Значение;
	//	ТаблицаДанных.Удалить(СтрокаДома);
	//КонецЕсли;
	//
	//СтрокаДома = ТаблицаДанных.Найти(2, "Вид");
	//Если СтрокаДома <> Неопределено Тогда
	//	Контекст.ТипСтроения = СтрокаДома.Тип;
	//	Контекст.Строение    = СтрокаДома.Значение;
	//	ТаблицаДанных.Удалить(СтрокаДома);
	//КонецЕсли;
	//
	//// Первое помещение указываем отдельно, остальные в списке
	//ТаблицаДанных = ЗданияИПомещения.Помещения;
	//НомерСтроки   = ТаблицаДанных.Количество();
	//Если НомерСтроки > 0 Тогда
	//	Контекст.ТипПомещения = ТаблицаДанных[0].Тип;
	//	Контекст.Помещение    = ТаблицаДанных[0].Значение;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ГеографическаяЗонаПриИзмененииСервер(Зона)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Зона, "Страна, Регион");
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьГеозонуНаСервере(Долгота, Широта)

	Возврат Справочники.упГеографическиеЗоны.ВернутьГеографическуюЗону(Долгота, Широта);
	
КонецФункции

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	  
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	упСервисныеФункцииКлиентСервер.УстановитьКартинкуКомментария(Элементы.ГруппаКомментарий, Объект.Комментарий);
КонецПроцедуры

&НаСервере
Процедура НормализованноеНаименованиеНачалоВыбораНаСервере()
	НормализованноеНаименование = упГеокодированиеСервер.НормализованныйАдрес(Объект.Наименование);
	Если ЗначениеЗаполнено(НормализованноеНаименование) Тогда
		Объект.НормализованноеНаименование = НормализованноеНаименование;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НормализованноеНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НормализованноеНаименованиеНачалоВыбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВремяУбытияИзТочкиПриИзменении(Элемент)
	
	ОбновитьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДоступность(ЭтаФорма)
	
	ЭтаФорма.Элементы.ГруппаУбытиеИзТочки.Доступность = ЭтаФорма.Объект.ИспользоватьВремяУбытияИзТочки;
	
КонецПроцедуры

#КонецОбласти
